app/controllers/attendees_controller.rb

SELECT "attendees".* FROM "attendees"
---
  def index
    render json: Attendee.all, status: :ok

SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show

    attendee = Attendee.find_by(id:params[:id])