app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
        render json: Event.all, status: :ok

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        # check whether the event exists
        event = Event.find_by(id:params[:id])

INSERT INTO "events" ("title", "image", "description", "location", "age_limit", "capacity", "date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        # get the body of the event to be created
        event = Event.create(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "events" SET "title" = ?, "description" = ?, "location" = ?, "time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "tech event"], ["description", ""], ["location", ""], ["time", nil], ["updated_at", "2023-04-03 12:15:27.435241"], ["id", 19]]
---
    def update
        # check whether the event exists
        event = Event.find_by(id:params[:id])

        if event
            event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 4]]
---
    def destroy
         # check whether the event exists
         event = Event.find_by(id:params[:id])

        #  delete the event
        if event
            event.destroy