app/controllers/speakers_controller.rb

SELECT "speakers".* FROM "speakers"
---
        def index
          render json: Speaker.all, status: :ok

SELECT "events".* FROM "events" WHERE "events"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
        def set_event
          event = Event.find_by(id:params[:id])