app/controllers/sponsors_controller.rb

  def index
    render json: Sponsor.all, status: :ok
---
SELECT "sponsors".* FROM "sponsors"