app/controllers/users_controller.rb

    def index
        #get users
        render json: User.all, status: :ok
---
SELECT "users".* FROM "users"

    def show
        #check if user is present
        user = User.find_by(id:params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        #create a new user
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "age", "gender", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def login
        # get the user by email
        user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kelvin@email.com"], ["LIMIT", 1]]